variants = [
        'Архангельск\n'
        'Расположен на берегу Северного Ледовитого океана. Известен своими прекрасными белыми соборами и северными ледовыми пейзажами. Является портом и крупным центром добычи и переработки каменного угля.',
        'Астрахань\n'
        'Расположена на Волге, недалеко от ее впадения в Каспийское море. Известна своими рыбными ресурсами и астраханскими яблоками. Является важным торговым портом и центром рыбной промышленности.',
        'Барнаул\n'
        'Расположен в Алтайском крае, на берегу реки Обь. Является административным и культурным центром региона. Известен своими красивыми природными ландшафтами, горными массивами и историческими достопримечательностями.',
        'Белгород\n'
        'Расположен на западе России, недалеко от границы с Украиной. Является административным и экономическим центром Белгородской области. Известен своими архитектурными памятниками и промышленностью.',
        'Брянск\n'
        'Расположен на западе России, недалеко от границы с Украиной и Беларусью. Является административным и культурным центром Брянской области. Известен своей исторической и культурной значимостью, а также богатыми природными ресурсами.',
        'Великий Новгород\n'
        'Расположен на северо-западе России, недалеко от границы с Эстонией. Известен своими историческими памятниками, такими как Софийский собор и Кремль. Является одним из старейших городов в России и является частью всемирного наследия ЮНЕСКО.',
        'Владивосток\n'
        'Расположен на Дальнем Востоке России, на берегу Японского моря. Является крупнейшим морским портом России и важным транспортным узлом на Тихоокеанском побережье. Известен своими красивыми видами, линий небоскребов и богатой морской флорой и фауной.',
        'Владимир\n'
        'Расположен на центральной части России, недалеко от Москвы. Является административным и историческим центром Владимирской области. Известен своими историческими памятниками, такими как Успенский собор и Золотые ворота.',
        'Волгоград\n'
        'Расположен на берегу Волги, на юге России. Известен своим героическим прошлым и памятником "Родина-мать зовет!". Является важным промышленным центром и портом на Волге.',
        'Воронеж\n'
        'Расположен на юге Центральной России, на берегу реки Воронеж. Является крупным культурным и экономическим центром Черноземья. Известен своими архитектурными памятниками, парками и садами, а также промышленностью и сельским хозяйством.',
        'Екатеринбург\n'
        'Столица Свердловской области и третий по величине город России. Известен своими промышленными предприятиями, университетами и культурными достопримечательностями.',
        'Иваново \n'
        'Город в Ивановской области, известный как "город-ткач". Ивановская область является одним из ведущих центров текстильной промышленности в России.',
        'Ижевск \n'
        'Столица Удмуртской республики и крупный промышленный центр. Ижевск известен как место производства огнестрельного оружия, включая пистолеты и винтовки "Калашникова".',
        'Иркутск \n'
        'Город на востоке Сибири, расположенный на берегу реки Ангары. Иркутск является культурным и туристическим центром, а также важным транспортным узлом в Сибири.',
        'Йошкар-Ола \n'
        'Столица Республики Марий Эл и культурный центр марийского народа. Город славится своей архитектурой в стиле позднего классицизма и является популярным туристическим направлением.',
        'Казань \n'
        'Столица Республики Татарстан и один из крупнейших городов России. Казань является важным историческим, культурным и экономическим центром, а также имеет статус "города миллионника".',
        'Калининград\n'
        'Город в Калининградской области, расположенный на побережье Балтийского моря. Город известен своими историческими и культурными достопримечательностями, а также богатой природой.',
        'Кострома\n'
        'Город на реке Волге, расположенный в Костромской области. Кострома славится своей деревянной архитектурой, а также является туристическим и культурным центром.',
        'Краснодар\n'
        'Столица Краснодарского края и крупный экономический и культурный центр Южного федерального округа. Краснодар известен своим благоприятным климатом, сельскохозяйственными ресурсами и прекрасными пляжами Черного моря.',
        'Красноярск\n'
        'Город на берегу Енисея и крупный промышленный центр. Красноярск расположен в Сибири и является важным транспортным узлом в регионе, а также имеет богатую природу и множество достопримечательностей.',
        'Курск\n'
        'Город в Курской области, известный своей историей и природными ресурсами. Курск славится своими паломническими местами и культурными достопримечательностями.',
        'Липецк\n'
        'Город в Липецкой области и один из важных промышленных центров России. Липецк известен своими металлургическими и химическими предприятиями, а также является культурным и спортивным центром.',
        'Москва \n'
        'Столица и крупнейший город России. Москва является политическим, экономическим, культурным и историческим центром страны. Здесь находятся множество достопримечательностей, музеев и театров.',
        'Мурманск \n'
        'Город на северо-западе России, расположенный на берегу Баренцева моря. Мурманск является крупным морским и транспортным узлом, а также важным базой российского Северного флота.',
        'Набережные Челны \n'
        'Город в Республике Татарстан, известный своим автомобильным заводом и промышленными предприятиями. Набережные Челны также является культурным и спортивным центром региона.',
        'Нижний Новгород \n'
        'Город на Волге, расположенный в Приволжском федеральном округе. Нижний Новгород является одним из крупнейших экономических и культурных центров России, а также известен своими историческими достопримечательностями.',
        'Новосибирск \n'
        'Город в Сибири и административный центр Новосибирской области. Новосибирск является крупным промышленным и научным центром, а также имеет множество культурных и спортивных объектов.',
        'Омск \n'
        'Город на западе Сибири, расположенный на берегу реки Иртыш. Омск славится своим промышленным комплексом, научно-исследовательскими учреждениями и историческими достопримечательностями.',
        'Оренбург \n'
        'Город на границе Европы и Азии, расположенный на берегу реки Урал. Оренбург является культурным и историческим центром Оренбургской области, а также известен своей текстильной и пищевой промышленностью.',
        'Пенза \n'
        'Город в Пензенской области, расположенный на берегу реки Сура. Пенза является промышленным, культурным и туристическим центром, известным своей архитектурой и историческими достопримечательностями.'
        'Пермь \n'
        'Город расположенный на западе России, в Пермском крае. Один из крупнейших промышленных и культурных центров региона. Известен своим театром оперы и балета, а также многочисленными музеями и парками.',
        'Псков \n'
        'Древний город на западе России, расположенный в Псковской области. Известен своей богатой историей и культурным наследием. В городе много древних храмов, крепостей и монастырей.',
        'Пятигорск \n'
        'Курортный город на юге России, в Ставропольском крае. Известен своими природными источниками минеральной воды и горными ландшафтами. Пятигорск также является популярным местом для лечения и отдыха.',
        'Ростов-на-Дону \n'
        'Крупный город на юге России, расположенный на берегу реки Дон. Является одним из крупнейших экономических и культурных центров региона. Город славится своими многочисленными парками, набережной и историческими достопримечательностями.',
        'Рязань \n'
        'Город в центральной части России, расположенный в Рязанской области. Считается одним из древнейших городов России. Известна своей богатой историей и многочисленными историческими памятниками, включая Кремль Рязани.',
        'Самара \n'
        'Город на юго-востоке России, расположенный на берегу Волги. Является одним из крупнейших промышленных и культурных центров страны. Самара известна своим космическим центром и историческими достопримечательностями, такими как Старая Самара и Самарский крепостной комплекс.',
        'Санкт-Петербург \n'
        'Крупнейший город России, расположенный на побережье Балтийского моря. Является культурной столицей страны и известен своими многочисленными музеями, дворцами и художественными объектами. Санкт-Петербург также известен своими протяженными каналами и мостами.',
        'Саратов \n'
        'Город на востоке России, расположенный на берегу Волги. Является крупным промышленным и культурным центром региона. Известен своими театрами, музеями и архитектурными памятниками.',
        'Смоленск \n'
        'Город на западе России, расположенный в Смоленской области. Известен своими древними крепостями и храмами. Смоленск также имеет большую историческую и культурную значимость.',
        'Сочи \n'
        'Курортный город на побережье Черного моря, на юге России. Известен своим приятным климатом, живописными пляжами и горным ландшафтом. Сочи был хозяином зимних Олимпийских игр 2014 года.',
        'Ставрополь \n'
        'Город на юге России, расположенный в Ставропольском крае. Является административным центром края и известен своими природными красотами, включая горы, ущелья и озера.',
        'Тверь \n'
        'Город в центре России, расположенный в Тверской области. Имеет богатую историю и многочисленные исторические памятники, включая Кремль Твери и Тверскую областную картинную галерею.',
        'Тольятти \n'
        'Город на востоке России, расположенный в Самарской области. Знаменит своим автомобильным заводом и промышленностью. Тольятти расположен на берегу Волги и является одним из крупнейших автомобильных центров страны.',
        'Тула \n'
        'Город в центральной части России, расположенный в Тульской области. Известен своим оружейным производством и промышленностью. Тула славится своим Кремлем и Тульским оружейным музеем.',
        'Ульяновск \n'
        'Город на востоке России, расположенный в Ульяновской области. Является административным и культурным центром региона. Город известен своими историческими памятниками, включая рождественскую деревню Владимира Ленина.',
        'Уфа \n'
        'Город на урале, расположенный в Республике Башкортостан. Является одним из крупных экономических и культурных центров региона. Уфа славится своими многочисленными мечетями и прекрасными парками.',
        'Хабаровск \n'
        'Крупный город на дальнем востоке России, расположенный на берегу реки Амур. Является административным и культурным центром Хабаровского края. Город известен своими прекрасными парками, набережной и красивыми площадями.',
        'Чебоксары \n'
        'Город в центральной части России, расположенный в Чувашской Республике. Является административным и культурным центром региона. Чебоксары известны своими парками, соборами и национальным музеем.',
        'Челябинск \n'
        'Город на урале, расположенный в Челябинской области. Является крупным промышленным и культурным центром Урала. Челябинск известен своими промышленными предприятиями и многочисленными театрами и музеями.',
        'Ярославль \n'
        'Город на северо-западе России, расположенный на берегу реки Волги. Является культурным и историческим центром Золотого кольца России. Ярославль известен своими деревянными архитектурными памятниками и Кремлем.'
]

top10 = ['1. Москва - столица России, крупнейший город страны.Известна своими историческими и культурными достопримечательностями, включая Кремль, Красную площадь и Большой театр.Москва является экономическим, политическим и культурным центром России.\n'
         '2. Великий Новгород - город, расположенный на северо-западе России, является одним из древнейших городов страны.Известен своими древними церквями и крепостью, а также как исторический и культурный центр региона.\n'
         '3. Кавказские минеральные воды - курортный город на  кавказском регионе России, он славится своими природными источниками минеральной воды.Это популярное место для лечения и отдыха благодаря своим природным красотам и спа-курортам.\n'
         '4. Санкт-Петербург - второй по величине город России, расположенный на побережье Балтийского моря.Известен своими многочисленными дворцами, музеями и историческими достопримечательностями, такими как Эрмитаж, Зимний дворец и Петропавловская крепость.\n'
         '5. Екатеринбург - город на Урале, расположенный на границе Европы и Азии.Известен своей промышленностью и экономическим развитием.В Екатеринбурге также находится церковь на Крови, построенная на месте убийства последнего русского императора Николая II.\n'
         '6. Казань - город на востоке России, является столицей Республики Татарстан.Известен своими историческими и культурными достопримечательностями, такими как Казанский Кремль и Волгоградская площадь.Казань является культурным и религиозным центром Татарстана.\n'
         '7. Владивосток - город расположенный на Дальнем Востоке России, на берегу Тихого океана.Известен своим портом, который является важным торговым и транспортным узлом.Владивосток известен своими видовыми площадками и мостами.\n'
         '8. Новосибирск - крупный город на Сибири, расположенный на реке Обь.Является культурным и экономическим центром Сибири.Новосибирск славится своими театрами, университетами и научными центрами, такими как Академгородок.\n'
         '9. Калининград - город, находящийся на Балтийском побережье России между Польшей и Литвой.Известен своими историческими памятниками, включая Кронпринцесскую Королевскую крепость и Амбергский замок.Калининград также известен как культурный и экономический центр региона.\n'
         '10. Сочи - курортный город на Черноморском побережье России.Известен своим приятным климатом, пляжами и горным ландшафтом.Сочи был хозяином зимних Олимпийских игр 2014 года и является популярным туристическим направлением для отдыха и лечения.\n']